{
  "basic": {
    "name": "Di Wu",
    "email": "dev@wudi.me",
    "website": "https://wudi.me/resume",
    "profiles": [
      {
        "network": "github",
        "username": "5d",
        "url": "https://github.com/5d"
      }
    ]
  },
  "sections": [
    {
      "header": "summary",
      "items": [
        {
          "details": [
            {
              "label": "",
              "content": "10+ years of hands-on industry experience"
            },
            {
              "label": "",
              "content": "Experienced full-stack engineer with expertise in modern front-end frameworks, widely-used back-end technologies, and the design of scalable, highly consistent, large-scale systems"
            },
            {
              "label": "",
              "content": "Passionate about functional programming, programming language theory, and formal verification"
            }
          ]
        }
      ]
    },
    {
      "header": "skills",
      "items": [
        {
          "details": [
            {
              "label": "Programming Languages",
              "content": "Javascript/Typescript, Java, Swift/Obj-C, Ruby, Python, Rust, C/C++, Haskell"
            },
            {
              "label": "Tools",
              "content": "Git, Docker, CI/CD, AWS, Nix"
            }
          ]
        }
      ]
    },
    {
      "header": "experience",
      "items": [
        {
          "title": [
            "Amazon",
            "Vancouver, Canada"
          ],
          "subtitle": [
            "Software Engineer",
            "Dec. 2020 -- Present"
          ],
          "details": [
            {
              "label": "AWS CDK",
              "content": "Contributor of the AWS open-source IaC project aws/aws-cdk and its associated packages."
            },
            {
              "label": "AWS Amplify for Apple platforms",
              "content": [
                "Developed and maintained the AWS open-source project aws-amplify/amplify-swift and its related packages.",
                "Developed and implemented the Amplify Swift DataStore AppSync real-time client using a native WebSocket in URLSession, leveraging Combine to manage streaming data. Additionally, created an extension package enabling customers to use ApolloGraphQL directly.",
                "Redesigned the CI/CD workflows, migrating from CircleCI to GitHub Actions, and enabled retrieval of credentials from AWS Secrets Manager instead of using environment variables, improving security and streamlining credential rotations."
              ]
            },
            {
              "label": "EC2 Load Balancing - VPC Lattice",
              "content": "Designed scalable database tables optimized for complex queries against listeners, rules, and target groups, ensuring high consistency with DynamoDB. Additionally, implemented the corresponding REST APIs and DAO layer."
            },
            {
              "label": "Amazon Selling Partner Services",
              "content": "Designed and implemented a deferral accounting engine capable of processing over 10+ million daily transactions to support the finance team. Additionally, maintained key accounting services supporting Amazon third-party sellers."
            }
          ]
        },
        {
          "title": [
            "UJET",
            "Remote"
          ],
          "subtitle": [
            "Software Engineer",
            "Mar. 2017 -- Apr. 2020"
          ],
          "details": [
            {
              "label": "VoIP Web App",
              "content": "Maintained and enhanced the VoIP web application, ensuring seamless integration with CRM platforms such as Salesforce and Zendesk."
            }
          ]
        },
        {
          "title": [
            "Rakunew",
            "Saitama, Japan"
          ],
          "subtitle": [
            "Software Engineer",
            "Jul. 2016 -- Mar. 2017"
          ],
          "details": [
            {
              "label": "XiaoTaoJiang",
              "content": "Redesigned and developed an e-commerce store iOS app using the latest WebKit framework. The app is hybrid, with the UI rendered in WebView and all asynchronous requests managed by native Swift code."
            },
            {
              "label": "QRCode Scanner",
              "content": "An iOS app for scanning and reading QR codes in Japan, automatically crawling and comparing prices across Amazon, Yahoo, and other Japanese online stores. The crawlers were developed in JavaScript, with the app serving as the orchestrator."
            }
          ]
        },
        {
          "title": [
            "Zoyi",
            "Seoul, South Korea"
          ],
          "subtitle": [
            "Software Engineer",
            "Jun. 2013 -- Jan. 2016"
          ],
          "details": [
            {
              "label": "Customized Linux Firmware",
              "content": "Designed and developed a Wi-Fi packet sniffing agent that detects Wi-Fi probe requests to regularly publish nearby devices. It is built on a Broadcom MIPS Linux system. Additionally, integrated iBeacon functionality into the Wi-Fi device using its onboard BLE chip."
            },
            {
              "label": "Wi-Fi Setup Smart Wizard",
              "content": "Designed and developed an iOS app for the initial setup of a Wi-Fi device using Bluetooth protocol."
            }
          ]
        },
        {
          "title": [
            "JIRANSOFT",
            "Seoul, South Korea"
          ],
          "subtitle": [
            "Software Engineer",
            "Apr. 2011 -- Jun. 2013"
          ],
          "details": [
            {
              "label": "DirectReader",
              "content": "Designed and developed a cloud drive management app that enables users to easily share files between desktop and mobile devices."
            }
          ]
        }
      ]
    },
    {
      "header": "education",
      "items": [
        {
          "title": [
            "Chungnam National University",
            "Daejeon, South Korea"
          ],
          "subtitle": [
            "Bachelor of Engineering in Computer Engineering",
            "Mar. 2007 -- Mar. 2011"
          ]
        }
      ]
    }
  ]
}